fio-l2p-cache-randwrite-4k-1G/fio_test_20260227_164454.log
=== 测试开始于 Fri Feb 27 16:44:54 UTC 2026 ===
=== 测试配置 ===
DEV: /dev/nvme0n1
OFFSET: 1G
SIZE: 1G
日志文件: /home/g122622/exp_results/fio_test_20260227_164454.log
================================
=== 开始预填充 (Pre-conditioning) ===
pre: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
fio-3.28
Starting 1 process

pre: (groupid=0, jobs=1): err= 0: pid=1148: Fri Feb 27 16:44:58 2026
  write: IOPS=77.7k, BW=304MiB/s (318MB/s)(1024MiB/3372msec); 0 zone resets
    slat (nsec): min=547, max=1378.8k, avg=9232.12, stdev=7462.31
    clat (usec): min=545, max=2452, avg=813.33, stdev=77.20
     lat (usec): min=787, max=2461, avg=822.65, stdev=77.37
    clat percentiles (usec):
     |  1.00th=[  775],  5.00th=[  783], 10.00th=[  783], 20.00th=[  783],
     | 30.00th=[  791], 40.00th=[  791], 50.00th=[  791], 60.00th=[  799],
     | 70.00th=[  807], 80.00th=[  816], 90.00th=[  857], 95.00th=[  906],
     | 99.00th=[ 1090], 99.50th=[ 1205], 99.90th=[ 2008], 99.95th=[ 2180],
     | 99.99th=[ 2343]
   bw (  KiB/s): min=308736, max=314336, per=100.00%, avg=312252.00, stdev=2099.99, samples=6
   iops        : min=77184, max=78584, avg=78063.00, stdev=525.00, samples=6
  lat (usec)   : 750=0.19%, 1000=97.70%
  lat (msec)   : 2=2.01%, 4=0.10%
  cpu          : usr=7.06%, sys=75.73%, ctx=27437, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=304MiB/s (318MB/s), 304MiB/s-304MiB/s (318MB/s-318MB/s), io=1024MiB (1074MB), run=3372-3372msec

Disk stats (read/write):
  nvme0n1: ios=48/245440, merge=0/0, ticks=0/194498, in_queue=194499, util=97.23%
=== 开始 QD 扫描测试 ===
--- Testing QD=1 ---
test_qd1: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.28
Starting 1 process

test_qd1: (groupid=0, jobs=1): err= 0: pid=1165: Fri Feb 27 16:45:01 2026
  write: IOPS=1191, BW=4766KiB/s (4881kB/s)(14.0MiB/3001msec); 0 zone resets
    slat (usec): min=7, max=432, avg=18.87, stdev=13.92
    clat (usec): min=724, max=4822, avg=818.00, stdev=77.40
     lat (usec): min=800, max=4944, avg=837.03, stdev=80.66
    clat percentiles (usec):
     |  1.00th=[  791],  5.00th=[  799], 10.00th=[  799], 20.00th=[  799],
     | 30.00th=[  799], 40.00th=[  807], 50.00th=[  807], 60.00th=[  816],
     | 70.00th=[  824], 80.00th=[  824], 90.00th=[  840], 95.00th=[  857],
     | 99.00th=[  938], 99.50th=[  971], 99.90th=[ 1450], 99.95th=[ 1713],
     | 99.99th=[ 4817]
   bw (  KiB/s): min= 4648, max= 4824, per=100.00%, avg=4771.20, stdev=73.67, samples=5
   iops        : min= 1162, max= 1206, avg=1192.80, stdev=18.42, samples=5
  lat (usec)   : 750=0.11%, 1000=99.52%
  lat (msec)   : 2=0.34%, 10=0.03%
  cpu          : usr=1.03%, sys=3.37%, ctx=3576, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,3576,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4766KiB/s (4881kB/s), 4766KiB/s-4766KiB/s (4881kB/s-4881kB/s), io=14.0MiB (14.6MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=51/3453, merge=0/0, ticks=1/2830, in_queue=2831, util=97.10%

--- Testing QD=2 ---
test_qd2: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
fio-3.28
Starting 1 process

test_qd2: (groupid=0, jobs=1): err= 0: pid=1181: Fri Feb 27 16:45:04 2026
  write: IOPS=2409, BW=9639KiB/s (9871kB/s)(28.2MiB/3001msec); 0 zone resets
    slat (nsec): min=1008, max=170919, avg=11204.79, stdev=7166.55
    clat (usec): min=681, max=2185, avg=817.49, stdev=37.86
     lat (usec): min=789, max=2193, avg=828.80, stdev=38.30
    clat percentiles (usec):
     |  1.00th=[  791],  5.00th=[  799], 10.00th=[  799], 20.00th=[  799],
     | 30.00th=[  799], 40.00th=[  807], 50.00th=[  807], 60.00th=[  816],
     | 70.00th=[  824], 80.00th=[  832], 90.00th=[  840], 95.00th=[  865],
     | 99.00th=[  914], 99.50th=[  947], 99.90th=[ 1156], 99.95th=[ 1614],
     | 99.99th=[ 2180]
   bw (  KiB/s): min= 9568, max= 9712, per=100.00%, avg=9657.60, stdev=58.35, samples=5
   iops        : min= 2392, max= 2428, avg=2414.40, stdev=14.59, samples=5
  lat (usec)   : 750=0.08%, 1000=99.63%
  lat (msec)   : 2=0.28%, 4=0.01%
  cpu          : usr=0.77%, sys=3.97%, ctx=3838, majf=0, minf=11
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,7232,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2

Run status group 0 (all jobs):
  WRITE: bw=9639KiB/s (9871kB/s), 9639KiB/s-9639KiB/s (9871kB/s-9871kB/s), io=28.2MiB (29.6MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=48/6986, merge=0/0, ticks=1/5641, in_queue=5642, util=97.06%

--- Testing QD=4 ---
test_qd4: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=4
fio-3.28
Starting 1 process

test_qd4: (groupid=0, jobs=1): err= 0: pid=1197: Fri Feb 27 16:45:08 2026
  write: IOPS=4775, BW=18.7MiB/s (19.6MB/s)(56.0MiB/3001msec); 0 zone resets
    slat (nsec): min=657, max=240743, avg=9701.27, stdev=6770.97
    clat (usec): min=591, max=3538, avg=827.04, stdev=61.08
     lat (usec): min=789, max=3576, avg=836.83, stdev=61.64
    clat percentiles (usec):
     |  1.00th=[  791],  5.00th=[  799], 10.00th=[  807], 20.00th=[  807],
     | 30.00th=[  807], 40.00th=[  816], 50.00th=[  816], 60.00th=[  824],
     | 70.00th=[  832], 80.00th=[  840], 90.00th=[  857], 95.00th=[  873],
     | 99.00th=[  947], 99.50th=[ 1004], 99.90th=[ 1500], 99.95th=[ 1942],
     | 99.99th=[ 3523]
   bw (  KiB/s): min=18944, max=19216, per=100.00%, avg=19136.20, stdev=111.43, samples=5
   iops        : min= 4736, max= 4804, avg=4784.00, stdev=27.86, samples=5
  lat (usec)   : 750=0.08%, 1000=99.42%
  lat (msec)   : 2=0.45%, 4=0.05%
  cpu          : usr=1.13%, sys=6.57%, ctx=4402, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,14330,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
  WRITE: bw=18.7MiB/s (19.6MB/s), 18.7MiB/s-18.7MiB/s (19.6MB/s-19.6MB/s), io=56.0MiB (58.7MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=48/13838, merge=0/0, ticks=0/11149, in_queue=11149, util=97.10%

--- Testing QD=8 ---
test_qd8: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
fio-3.28
Starting 1 process

test_qd8: (groupid=0, jobs=1): err= 0: pid=1213: Fri Feb 27 16:45:11 2026
  write: IOPS=9503, BW=37.1MiB/s (38.9MB/s)(111MiB/3001msec); 0 zone resets
    slat (nsec): min=604, max=781775, avg=9412.97, stdev=7707.19
    clat (usec): min=519, max=2201, avg=831.50, stdev=48.40
     lat (usec): min=788, max=2208, avg=841.01, stdev=48.18
    clat percentiles (usec):
     |  1.00th=[  783],  5.00th=[  791], 10.00th=[  799], 20.00th=[  807],
     | 30.00th=[  807], 40.00th=[  816], 50.00th=[  824], 60.00th=[  832],
     | 70.00th=[  840], 80.00th=[  857], 90.00th=[  865], 95.00th=[  881],
     | 99.00th=[  955], 99.50th=[ 1045], 99.90th=[ 1385], 99.95th=[ 1745],
     | 99.99th=[ 2147]
   bw (  KiB/s): min=37968, max=38248, per=100.00%, avg=38095.00, stdev=108.04, samples=5
   iops        : min= 9492, max= 9562, avg=9523.60, stdev=27.14, samples=5
  lat (usec)   : 750=0.09%, 1000=99.20%
  lat (msec)   : 2=0.69%, 4=0.02%
  cpu          : usr=1.87%, sys=11.10%, ctx=4842, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,28519,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=37.1MiB/s (38.9MB/s), 37.1MiB/s-37.1MiB/s (38.9MB/s-38.9MB/s), io=111MiB (117MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=51/27571, merge=0/0, ticks=1/22051, in_queue=22052, util=97.06%

--- Testing QD=16 ---
test_qd16: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.28
Starting 1 process

test_qd16: (groupid=0, jobs=1): err= 0: pid=1229: Fri Feb 27 16:45:14 2026
  write: IOPS=18.8k, BW=73.4MiB/s (77.0MB/s)(220MiB/3001msec); 0 zone resets
    slat (nsec): min=585, max=146382, avg=9472.61, stdev=5604.18
    clat (usec): min=678, max=2590, avg=841.03, stdev=60.06
     lat (usec): min=788, max=2597, avg=850.60, stdev=59.76
    clat percentiles (usec):
     |  1.00th=[  783],  5.00th=[  791], 10.00th=[  799], 20.00th=[  807],
     | 30.00th=[  816], 40.00th=[  824], 50.00th=[  832], 60.00th=[  840],
     | 70.00th=[  857], 80.00th=[  873], 90.00th=[  898], 95.00th=[  922],
     | 99.00th=[  988], 99.50th=[ 1057], 99.90th=[ 1680], 99.95th=[ 1827],
     | 99.99th=[ 2573]
   bw (  KiB/s): min=74648, max=76200, per=100.00%, avg=75702.40, stdev=605.74, samples=5
   iops        : min=18662, max=19050, avg=18925.60, stdev=151.44, samples=5
  lat (usec)   : 750=0.05%, 1000=99.13%
  lat (msec)   : 2=0.79%, 4=0.04%
  cpu          : usr=2.50%, sys=20.53%, ctx=5367, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,56403,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=73.4MiB/s (77.0MB/s), 73.4MiB/s-73.4MiB/s (77.0MB/s-77.0MB/s), io=220MiB (231MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=51/54595, merge=0/0, ticks=1/43697, in_queue=43697, util=97.00%

--- Testing QD=24 ---
test_qd24: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=24
fio-3.28
Starting 1 process

test_qd24: (groupid=0, jobs=1): err= 0: pid=1247: Fri Feb 27 16:45:17 2026
  write: IOPS=27.6k, BW=108MiB/s (113MB/s)(323MiB/3001msec); 0 zone resets
    slat (nsec): min=561, max=379543, avg=9880.32, stdev=7160.59
    clat (usec): min=454, max=2222, avg=859.75, stdev=64.53
     lat (usec): min=804, max=2230, avg=869.72, stdev=64.10
    clat percentiles (usec):
     |  1.00th=[  799],  5.00th=[  807], 10.00th=[  816], 20.00th=[  824],
     | 30.00th=[  832], 40.00th=[  840], 50.00th=[  848], 60.00th=[  857],
     | 70.00th=[  873], 80.00th=[  889], 90.00th=[  922], 95.00th=[  947],
     | 99.00th=[ 1057], 99.50th=[ 1172], 99.90th=[ 1713], 99.95th=[ 1909],
     | 99.99th=[ 2212]
   bw (  KiB/s): min=109352, max=110978, per=99.92%, avg=110211.20, stdev=598.59, samples=5
   iops        : min=27338, max=27744, avg=27552.60, stdev=149.48, samples=5
  lat (usec)   : 500=0.01%, 750=0.06%, 1000=98.26%
  lat (msec)   : 2=1.65%, 4=0.02%
  cpu          : usr=2.30%, sys=31.67%, ctx=7990, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,82754,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=24

Run status group 0 (all jobs):
  WRITE: bw=108MiB/s (113MB/s), 108MiB/s-108MiB/s (113MB/s-113MB/s), io=323MiB (339MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=48/79926, merge=0/0, ticks=0/65251, in_queue=65252, util=97.03%

--- Testing QD=32 ---
test_qd32: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.28
Starting 1 process

test_qd32: (groupid=0, jobs=1): err= 0: pid=1263: Fri Feb 27 16:45:21 2026
  write: IOPS=37.5k, BW=147MiB/s (154MB/s)(440MiB/3001msec); 0 zone resets
    slat (nsec): min=552, max=1405.4k, avg=9396.97, stdev=7471.16
    clat (usec): min=473, max=2422, avg=842.50, stdev=69.57
     lat (usec): min=798, max=2429, avg=851.99, stdev=69.27
    clat percentiles (usec):
     |  1.00th=[  791],  5.00th=[  799], 10.00th=[  799], 20.00th=[  807],
     | 30.00th=[  816], 40.00th=[  816], 50.00th=[  824], 60.00th=[  832],
     | 70.00th=[  848], 80.00th=[  865], 90.00th=[  906], 95.00th=[  938],
     | 99.00th=[ 1074], 99.50th=[ 1139], 99.90th=[ 1860], 99.95th=[ 2073],
     | 99.99th=[ 2409]
   bw (  KiB/s): min=149112, max=150720, per=99.85%, avg=149910.60, stdev=696.10, samples=5
   iops        : min=37278, max=37680, avg=37477.40, stdev=173.99, samples=5
  lat (usec)   : 500=0.01%, 750=0.08%, 1000=97.95%
  lat (msec)   : 2=1.91%, 4=0.06%
  cpu          : usr=4.80%, sys=37.80%, ctx=11552, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,112644,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=147MiB/s (154MB/s), 147MiB/s-147MiB/s (154MB/s-154MB/s), io=440MiB (461MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=48/108715, merge=0/0, ticks=0/87888, in_queue=87888, util=97.10%

--- Testing QD=40 ---
test_qd40: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=40
fio-3.28
Starting 1 process

test_qd40: (groupid=0, jobs=1): err= 0: pid=1279: Fri Feb 27 16:45:24 2026
  write: IOPS=47.8k, BW=187MiB/s (196MB/s)(560MiB/3001msec); 0 zone resets
    slat (nsec): min=554, max=1419.3k, avg=9285.13, stdev=7016.72
    clat (usec): min=374, max=2386, avg=827.54, stdev=66.21
     lat (usec): min=794, max=2394, avg=836.92, stdev=66.12
    clat percentiles (usec):
     |  1.00th=[  783],  5.00th=[  791], 10.00th=[  791], 20.00th=[  799],
     | 30.00th=[  799], 40.00th=[  807], 50.00th=[  816], 60.00th=[  816],
     | 70.00th=[  824], 80.00th=[  840], 90.00th=[  881], 95.00th=[  914],
     | 99.00th=[ 1020], 99.50th=[ 1106], 99.90th=[ 1827], 99.95th=[ 2147],
     | 99.99th=[ 2343]
   bw (  KiB/s): min=188456, max=192872, per=100.00%, avg=191198.40, stdev=1719.99, samples=5
   iops        : min=47114, max=48218, avg=47799.60, stdev=430.00, samples=5
  lat (usec)   : 500=0.01%, 750=0.08%, 1000=98.64%
  lat (msec)   : 2=1.19%, 4=0.09%
  cpu          : usr=5.83%, sys=48.20%, ctx=17130, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,143338,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=40

Run status group 0 (all jobs):
  WRITE: bw=187MiB/s (196MB/s), 187MiB/s-187MiB/s (196MB/s-196MB/s), io=560MiB (587MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=48/138363, merge=0/0, ticks=1/110934, in_queue=110935, util=96.99%

--- Testing QD=48 ---
test_qd48: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=48
fio-3.28
Starting 1 process

test_qd48: (groupid=0, jobs=1): err= 0: pid=1295: Fri Feb 27 16:45:27 2026
  write: IOPS=57.3k, BW=224MiB/s (235MB/s)(671MiB/3001msec); 0 zone resets
    slat (nsec): min=556, max=1292.1k, avg=9366.14, stdev=7088.80
    clat (usec): min=456, max=2189, avg=828.25, stdev=78.88
     lat (usec): min=792, max=2200, avg=837.70, stdev=78.95
    clat percentiles (usec):
     |  1.00th=[  783],  5.00th=[  791], 10.00th=[  791], 20.00th=[  791],
     | 30.00th=[  799], 40.00th=[  799], 50.00th=[  807], 60.00th=[  816],
     | 70.00th=[  824], 80.00th=[  840], 90.00th=[  889], 95.00th=[  930],
     | 99.00th=[ 1123], 99.50th=[ 1319], 99.90th=[ 1778], 99.95th=[ 2008],
     | 99.99th=[ 2089]
   bw (  KiB/s): min=225704, max=231128, per=100.00%, avg=229588.80, stdev=2245.03, samples=5
   iops        : min=56426, max=57782, avg=57397.20, stdev=561.26, samples=5
  lat (usec)   : 500=0.01%, 750=0.15%, 1000=97.50%
  lat (msec)   : 2=2.30%, 4=0.05%
  cpu          : usr=8.30%, sys=56.53%, ctx=19479, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,171850,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=48

Run status group 0 (all jobs):
  WRITE: bw=224MiB/s (235MB/s), 224MiB/s-224MiB/s (235MB/s-235MB/s), io=671MiB (704MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=48/165996, merge=0/0, ticks=1/132682, in_queue=132684, util=97.10%

--- Testing QD=56 ---
test_qd56: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=56
fio-3.28
Starting 1 process

test_qd56: (groupid=0, jobs=1): err= 0: pid=1311: Fri Feb 27 16:45:30 2026
  write: IOPS=67.3k, BW=263MiB/s (276MB/s)(789MiB/3001msec); 0 zone resets
    slat (nsec): min=569, max=1425.8k, avg=9304.45, stdev=7390.21
    clat (usec): min=385, max=2351, avg=821.82, stdev=72.71
     lat (usec): min=791, max=2358, avg=831.22, stdev=72.70
    clat percentiles (usec):
     |  1.00th=[  783],  5.00th=[  783], 10.00th=[  783], 20.00th=[  791],
     | 30.00th=[  791], 40.00th=[  799], 50.00th=[  799], 60.00th=[  807],
     | 70.00th=[  816], 80.00th=[  832], 90.00th=[  873], 95.00th=[  930],
     | 99.00th=[ 1106], 99.50th=[ 1172], 99.90th=[ 1696], 99.95th=[ 2147],
     | 99.99th=[ 2278]
   bw (  KiB/s): min=266360, max=272488, per=100.00%, avg=269681.60, stdev=2743.95, samples=5
   iops        : min=66590, max=68122, avg=67420.40, stdev=685.99, samples=5
  lat (usec)   : 500=0.01%, 750=0.15%, 1000=97.58%
  lat (msec)   : 2=2.19%, 4=0.08%
  cpu          : usr=8.37%, sys=65.93%, ctx=20391, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,202060,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=56

Run status group 0 (all jobs):
  WRITE: bw=263MiB/s (276MB/s), 263MiB/s-263MiB/s (276MB/s-276MB/s), io=789MiB (828MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=50/195099, merge=0/0, ticks=1/155516, in_queue=155518, util=96.96%

--- Testing QD=64 ---
test_qd64: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
fio-3.28
Starting 1 process

test_qd64: (groupid=0, jobs=1): err= 0: pid=1327: Fri Feb 27 16:45:33 2026
  write: IOPS=77.2k, BW=302MiB/s (316MB/s)(905MiB/3001msec); 0 zone resets
    slat (nsec): min=554, max=1268.7k, avg=9362.03, stdev=7083.92
    clat (usec): min=557, max=2231, avg=819.03, stdev=68.75
     lat (usec): min=789, max=2238, avg=828.48, stdev=68.64
    clat percentiles (usec):
     |  1.00th=[  783],  5.00th=[  783], 10.00th=[  783], 20.00th=[  791],
     | 30.00th=[  791], 40.00th=[  791], 50.00th=[  799], 60.00th=[  807],
     | 70.00th=[  816], 80.00th=[  832], 90.00th=[  873], 95.00th=[  930],
     | 99.00th=[ 1090], 99.50th=[ 1172], 99.90th=[ 1336], 99.95th=[ 2089],
     | 99.99th=[ 2180]
   bw (  KiB/s): min=308455, max=310504, per=100.00%, avg=309489.00, stdev=883.23, samples=5
   iops        : min=77113, max=77626, avg=77372.00, stdev=221.14, samples=5
  lat (usec)   : 750=0.19%, 1000=97.46%
  lat (msec)   : 2=2.27%, 4=0.08%
  cpu          : usr=8.57%, sys=74.97%, ctx=21060, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,231688,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=302MiB/s (316MB/s), 302MiB/s-302MiB/s (316MB/s-316MB/s), io=905MiB (949MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=48/223729, merge=0/0, ticks=0/177939, in_queue=177938, util=96.99%

--- Testing QD=72 ---
test_qd72: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=72
fio-3.28
Starting 1 process

test_qd72: (groupid=0, jobs=1): err= 0: pid=1343: Fri Feb 27 16:45:37 2026
  write: IOPS=86.0k, BW=336MiB/s (352MB/s)(1008MiB/3001msec); 0 zone resets
    slat (nsec): min=548, max=1251.7k, avg=9233.28, stdev=6818.56
    clat (usec): min=550, max=2507, avg=827.19, stdev=93.65
     lat (usec): min=789, max=2514, avg=836.52, stdev=93.77
    clat percentiles (usec):
     |  1.00th=[  783],  5.00th=[  783], 10.00th=[  783], 20.00th=[  791],
     | 30.00th=[  791], 40.00th=[  799], 50.00th=[  799], 60.00th=[  807],
     | 70.00th=[  816], 80.00th=[  832], 90.00th=[  881], 95.00th=[  963],
     | 99.00th=[ 1221], 99.50th=[ 1319], 99.90th=[ 2147], 99.95th=[ 2245],
     | 99.99th=[ 2474]
   bw (  KiB/s): min=342504, max=345504, per=99.95%, avg=343909.80, stdev=1401.09, samples=5
   iops        : min=85626, max=86376, avg=85977.40, stdev=350.21, samples=5
  lat (usec)   : 750=0.13%, 1000=96.13%
  lat (msec)   : 2=3.58%, 4=0.15%
  cpu          : usr=6.50%, sys=83.53%, ctx=15891, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,258148,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=72

Run status group 0 (all jobs):
  WRITE: bw=336MiB/s (352MB/s), 336MiB/s-336MiB/s (352MB/s-352MB/s), io=1008MiB (1057MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=51/249246, merge=0/0, ticks=1/198084, in_queue=198085, util=97.06%

--- Testing QD=80 ---
test_qd80: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=80
fio-3.28
Starting 1 process

test_qd80: (groupid=0, jobs=1): err= 0: pid=1359: Fri Feb 27 16:45:40 2026
  write: IOPS=92.7k, BW=362MiB/s (380MB/s)(1087MiB/3001msec); 0 zone resets
    slat (nsec): min=536, max=1356.3k, avg=9338.06, stdev=8405.41
    clat (usec): min=619, max=2923, avg=852.64, stdev=122.13
     lat (usec): min=788, max=2936, avg=862.07, stdev=122.42
    clat percentiles (usec):
     |  1.00th=[  783],  5.00th=[  783], 10.00th=[  791], 20.00th=[  791],
     | 30.00th=[  799], 40.00th=[  807], 50.00th=[  816], 60.00th=[  824],
     | 70.00th=[  840], 80.00th=[  873], 90.00th=[  955], 95.00th=[ 1057],
     | 99.00th=[ 1352], 99.50th=[ 1483], 99.90th=[ 2245], 99.95th=[ 2376],
     | 99.99th=[ 2769]
   bw (  KiB/s): min=365560, max=376872, per=100.00%, avg=370984.20, stdev=4596.13, samples=5
   iops        : min=91390, max=94218, avg=92746.00, stdev=1149.03, samples=5
  lat (usec)   : 750=0.05%, 1000=92.84%
  lat (msec)   : 2=6.89%, 4=0.22%
  cpu          : usr=10.67%, sys=85.30%, ctx=6259, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,278320,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=80

Run status group 0 (all jobs):
  WRITE: bw=362MiB/s (380MB/s), 362MiB/s-362MiB/s (380MB/s-380MB/s), io=1087MiB (1140MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=48/268889, merge=0/0, ticks=0/213730, in_queue=213731, util=96.99%

--- Testing QD=88 ---
test_qd88: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=88
fio-3.28
Starting 1 process

test_qd88: (groupid=0, jobs=1): err= 0: pid=1375: Fri Feb 27 16:45:43 2026
  write: IOPS=98.2k, BW=384MiB/s (402MB/s)(1152MiB/3001msec); 0 zone resets
    slat (nsec): min=535, max=1432.1k, avg=9259.35, stdev=7746.35
    clat (usec): min=546, max=2474, avg=885.89, stdev=110.41
     lat (usec): min=788, max=2483, avg=895.24, stdev=110.76
    clat percentiles (usec):
     |  1.00th=[  791],  5.00th=[  799], 10.00th=[  807], 20.00th=[  816],
     | 30.00th=[  832], 40.00th=[  848], 50.00th=[  857], 60.00th=[  873],
     | 70.00th=[  889], 80.00th=[  922], 90.00th=[  988], 95.00th=[ 1074],
     | 99.00th=[ 1336], 99.50th=[ 1483], 99.90th=[ 1975], 99.95th=[ 2180],
     | 99.99th=[ 2409]
   bw (  KiB/s): min=386576, max=399040, per=99.77%, avg=392075.80, stdev=5191.90, samples=5
   iops        : min=96644, max=99760, avg=98018.80, stdev=1297.89, samples=5
  lat (usec)   : 750=0.01%, 1000=91.22%
  lat (msec)   : 2=8.68%, 4=0.09%
  cpu          : usr=9.30%, sys=89.47%, ctx=952, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,294825,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=88

Run status group 0 (all jobs):
  WRITE: bw=384MiB/s (402MB/s), 384MiB/s-384MiB/s (402MB/s-402MB/s), io=1152MiB (1208MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=51/284694, merge=0/0, ticks=1/226165, in_queue=226166, util=97.06%

--- Testing QD=96 ---
test_qd96: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=96
fio-3.28
Starting 1 process

test_qd96: (groupid=0, jobs=1): err= 0: pid=1392: Fri Feb 27 16:45:46 2026
  write: IOPS=98.6k, BW=385MiB/s (404MB/s)(1156MiB/3001msec); 0 zone resets
    slat (nsec): min=539, max=1408.1k, avg=9274.48, stdev=8143.53
    clat (usec): min=655, max=2761, avg=963.86, stdev=126.84
     lat (usec): min=788, max=2783, avg=973.23, stdev=127.35
    clat percentiles (usec):
     |  1.00th=[  807],  5.00th=[  848], 10.00th=[  873], 20.00th=[  889],
     | 30.00th=[  906], 40.00th=[  922], 50.00th=[  930], 60.00th=[  955],
     | 70.00th=[  971], 80.00th=[ 1012], 90.00th=[ 1074], 95.00th=[ 1188],
     | 99.00th=[ 1450], 99.50th=[ 1582], 99.90th=[ 2343], 99.95th=[ 2507],
     | 99.99th=[ 2573]
   bw (  KiB/s): min=389936, max=400264, per=100.00%, avg=394638.40, stdev=4165.78, samples=5
   iops        : min=97484, max=100066, avg=98659.60, stdev=1041.45, samples=5
  lat (usec)   : 750=0.01%, 1000=78.13%
  lat (msec)   : 2=21.70%, 4=0.17%
  cpu          : usr=9.50%, sys=89.67%, ctx=517, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,295843,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=96

Run status group 0 (all jobs):
  WRITE: bw=385MiB/s (404MB/s), 385MiB/s-385MiB/s (404MB/s-404MB/s), io=1156MiB (1212MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=49/285849, merge=0/0, ticks=1/227118, in_queue=227119, util=97.06%

--- Testing QD=104 ---
test_qd104: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=104
fio-3.28
Starting 1 process

test_qd104: (groupid=0, jobs=1): err= 0: pid=1408: Fri Feb 27 16:45:50 2026
  write: IOPS=96.9k, BW=378MiB/s (397MB/s)(1136MiB/3001msec); 0 zone resets
    slat (nsec): min=528, max=1565.0k, avg=9369.67, stdev=8903.48
    clat (usec): min=630, max=3956, avg=1063.59, stdev=177.25
     lat (usec): min=788, max=3956, avg=1073.06, stdev=177.93
    clat percentiles (usec):
     |  1.00th=[  824],  5.00th=[  906], 10.00th=[  947], 20.00th=[  979],
     | 30.00th=[  996], 40.00th=[ 1012], 50.00th=[ 1029], 60.00th=[ 1057],
     | 70.00th=[ 1074], 80.00th=[ 1106], 90.00th=[ 1205], 95.00th=[ 1319],
     | 99.00th=[ 1745], 99.50th=[ 2278], 99.90th=[ 2737], 99.95th=[ 2933],
     | 99.99th=[ 3425]
   bw (  KiB/s): min=380808, max=393600, per=100.00%, avg=387788.60, stdev=6379.48, samples=5
   iops        : min=95202, max=98400, avg=96947.00, stdev=1594.74, samples=5
  lat (usec)   : 750=0.01%, 1000=33.73%
  lat (msec)   : 2=65.57%, 4=0.69%
  cpu          : usr=9.83%, sys=89.27%, ctx=537, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,290691,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=104

Run status group 0 (all jobs):
  WRITE: bw=378MiB/s (397MB/s), 378MiB/s-378MiB/s (397MB/s-397MB/s), io=1136MiB (1191MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=49/280750, merge=0/0, ticks=0/223311, in_queue=223311, util=96.96%

--- Testing QD=112 ---
test_qd112: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=112
fio-3.28
Starting 1 process

test_qd112: (groupid=0, jobs=1): err= 0: pid=1424: Fri Feb 27 16:45:53 2026
  write: IOPS=97.7k, BW=382MiB/s (400MB/s)(1146MiB/3001msec); 0 zone resets
    slat (nsec): min=532, max=1387.8k, avg=9307.17, stdev=8272.03
    clat (usec): min=687, max=2860, avg=1135.78, stdev=147.45
     lat (usec): min=788, max=2861, avg=1145.18, stdev=147.80
    clat percentiles (usec):
     |  1.00th=[  840],  5.00th=[  955], 10.00th=[ 1029], 20.00th=[ 1057],
     | 30.00th=[ 1074], 40.00th=[ 1090], 50.00th=[ 1123], 60.00th=[ 1139],
     | 70.00th=[ 1156], 80.00th=[ 1188], 90.00th=[ 1270], 95.00th=[ 1336],
     | 99.00th=[ 1663], 99.50th=[ 1860], 99.90th=[ 2606], 99.95th=[ 2704],
     | 99.99th=[ 2769]
   bw (  KiB/s): min=386400, max=393528, per=99.63%, avg=389515.20, stdev=2594.29, samples=5
   iops        : min=96600, max=98382, avg=97378.80, stdev=648.57, samples=5
  lat (usec)   : 750=0.01%, 1000=7.41%
  lat (msec)   : 2=92.19%, 4=0.40%
  cpu          : usr=8.37%, sys=90.90%, ctx=378, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,293323,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=112

Run status group 0 (all jobs):
  WRITE: bw=382MiB/s (400MB/s), 382MiB/s-382MiB/s (400MB/s-400MB/s), io=1146MiB (1201MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=51/282987, merge=0/0, ticks=0/225224, in_queue=225225, util=96.93%

--- Testing QD=120 ---
test_qd120: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=120
fio-3.28
Starting 1 process

test_qd120: (groupid=0, jobs=1): err= 0: pid=1440: Fri Feb 27 16:45:56 2026
  write: IOPS=98.0k, BW=383MiB/s (402MB/s)(1149MiB/3001msec); 0 zone resets
    slat (nsec): min=532, max=1472.3k, avg=9214.24, stdev=8369.23
    clat (usec): min=656, max=6166, avg=1214.15, stdev=291.87
     lat (usec): min=788, max=6175, avg=1223.45, stdev=292.13
    clat percentiles (usec):
     |  1.00th=[  865],  5.00th=[ 1012], 10.00th=[ 1090], 20.00th=[ 1123],
     | 30.00th=[ 1139], 40.00th=[ 1156], 50.00th=[ 1172], 60.00th=[ 1188],
     | 70.00th=[ 1221], 80.00th=[ 1254], 90.00th=[ 1336], 95.00th=[ 1500],
     | 99.00th=[ 1909], 99.50th=[ 3392], 99.90th=[ 5080], 99.95th=[ 5276],
     | 99.99th=[ 5669]
   bw (  KiB/s): min=386728, max=402808, per=100.00%, avg=393816.00, stdev=6656.61, samples=5
   iops        : min=96682, max=100702, avg=98454.00, stdev=1664.15, samples=5
  lat (usec)   : 750=0.01%, 1000=4.37%
  lat (msec)   : 2=94.75%, 4=0.50%, 10=0.38%
  cpu          : usr=7.87%, sys=90.20%, ctx=290, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,294192,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=120

Run status group 0 (all jobs):
  WRITE: bw=383MiB/s (402MB/s), 383MiB/s-383MiB/s (402MB/s-402MB/s), io=1149MiB (1205MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=51/284409, merge=0/0, ticks=0/230854, in_queue=230855, util=97.06%

--- Testing QD=128 ---
test_qd128: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=128
fio-3.28
Starting 1 process

test_qd128: (groupid=0, jobs=1): err= 0: pid=1456: Fri Feb 27 16:45:59 2026
  write: IOPS=96.7k, BW=378MiB/s (396MB/s)(1133MiB/3001msec); 0 zone resets
    slat (nsec): min=531, max=1407.3k, avg=9202.80, stdev=8258.63
    clat (usec): min=677, max=8716, avg=1314.03, stdev=447.64
     lat (usec): min=788, max=8724, avg=1323.33, stdev=447.79
    clat percentiles (usec):
     |  1.00th=[  873],  5.00th=[ 1057], 10.00th=[ 1156], 20.00th=[ 1188],
     | 30.00th=[ 1221], 40.00th=[ 1237], 50.00th=[ 1254], 60.00th=[ 1270],
     | 70.00th=[ 1303], 80.00th=[ 1336], 90.00th=[ 1434], 95.00th=[ 1614],
     | 99.00th=[ 2671], 99.50th=[ 5538], 99.90th=[ 6587], 99.95th=[ 7177],
     | 99.99th=[ 8225]
   bw (  KiB/s): min=377224, max=396960, per=100.00%, avg=389219.20, stdev=8737.19, samples=5
   iops        : min=94306, max=99240, avg=97304.80, stdev=2184.30, samples=5
  lat (usec)   : 750=0.01%, 1000=3.39%
  lat (msec)   : 2=94.91%, 4=0.90%, 10=0.79%
  cpu          : usr=9.37%, sys=87.43%, ctx=312, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,290118,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=378MiB/s (396MB/s), 378MiB/s-378MiB/s (396MB/s-396MB/s), io=1133MiB (1188MB), run=3001-3001msec

Disk stats (read/write):
  nvme0n1: ios=50/279782, merge=0/0, ticks=1/233086, in_queue=233087, util=96.93%

=== 测试完成于 Fri Feb 27 16:45:59 UTC 2026 ===
所有结果已保存到: /home/g122622/exp_results/fio_test_20260227_164454.log